//************************************************************
//  Copyright (c) 深圳市赛元微电子有限公司
//	文件名称	: PWM.c
//	作者		: 
//	模块功能	:PWM的使用
//	局部函数列表:
//  最后更正日期:
// 	版本		:
// 	更改记录	:rom前256byte禁止查表,因此在编译的时候，设置keil->option for Target->BL51 Locate->Code Range:0x100
//*************************************************************

#include "h\SC92F732X_C.h"
//*************************************************************
// 函数名	：void PWMinit(void)
// 作者		：
// 功能		：
// 参数		：无
// 返回值	：无
// 调用全局变量：无
// 修改全局变量：无
// 备注		：
//**************************************************************
void PWMinit(void)
{
	PWMCON = 0X38;  		//PWM0\PWM1\PWM2输出到I/O，Fsys频率；
 	PWMCFG = 0x00;			//不反向，P23,P26,P27输出
 	PWMPRD = 99;			//PWM周期=(99+1)			  240KHZ 4.167us
 	PWMDTY0 = 50;			//PWM0的Duty = 50/100  =1/2
 	PWMDTY1 = 25;			//PWM1的Duty = 25/100  =1/4
 	PWMDTY2 = 25;			//PWM2的Duty = 25/100  =1/4
//	PWMDTYA = 0x15;			//PWM2/PWM1/PWM0 duty微调，为PWMDTY设定值加1
 	PWMCON |= 0x80;			//开始PWM工作
}
//*************************************************************
// 函数名	：void PWM() interrupt 5
// 作者		：
// 功能		：PWM产生50us的中断
// 参数		：无
// 返回值	：无
// 调用全局变量：无
// 修改全局变量：无
// 备注		：PWM中断需用户软件清除
//**************************************************************
void PWM() interrupt 8
{
}

void main()
{
	P0CON =0XFF;
	P1CON =0XFF;
	P2CON =0XFF;
	WDTCON  = 0x10;				//清看门狗，500ms溢出
	PWMinit();
	IE1 |=0X02;				    //使能PWM中断
	EA=1;						//开总中断
	while(1)
	{
		WDTCON |= 0x10;		    //清看门狗
	}
}